fherrera124/spotify_app/sdkconfig.defaults
# Target board: JC3248W535 (ESP32-S3, 16MB flash, octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED=40
CONFIG_SPIRAM_USE_MALLOC=y

# mbedTLS must use PSRAM for its large TLS buffers (IN/OUT content len),
# otherwise TLS handshakes fail with PSA_ERROR_INSUFFICIENT_MEMORY once
# internal RAM gets contended by WiFi + display buffers.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
